<template>
    <main>
        <div class="about_us">
            <div class="main_ab_us_wrapper">
                <div class="about">
                    <div>
                        <p class="big_p">
                            О компании
                        </p>
                        <p>
                            Компания  «ТеплоВит» предлагает Вам современные инженерные решения и услуги по профессиональной комплектации объектов запорно-регулирующей арматурой, трубами и фитингами, насосным оборудованием и канализационными установками, котлами и водонагревателями, горелками и конвекторами, полотенцесушителями и радиаторами, а также системой «теплый пол». 
                            Мы специализируемся на комплексных поставках качественного оборудования для систем водоснабжения и отопления, которое поступает непосредственно со склада завода-изготовителя или его представительства, что является гарантией качества и хорошой цены поставляемой продукции.
                        
                            Удобная форма сотрудничества, гибкая система скидок и дополнительных услуг, а так же гарантированное надежное оборудование, разумная цена и своевременные поставки продукции являются ключевыми факторами внедрения оборудования компании «ТеплоВит». 
                            Мы работаем на объектах Витебска, Полоцка, Новополоцка, Оршы, Браслова, Постав, Миор, а также в Верхнедвинске, Лепеле, Лиозно, Чашниках, Глубоком, Сенно, Ушачах и других городах Витебской области и  всех регионах Беларусии.
                        
                            Компания «ТеплоВит» решает нестандартные задачи в области водоснабжения и отопления, содействует развитию бизнеса своих партнеров, соблюдает договорные условия и применяет в своей работе инновационные методы и индивидуальный подход к каждому покупателю.
                            Выгода, надежность и эффективность – это основные принципы сотрудничества с компанией «ТеплоВит».
                        </p>
                    </div>
                    <div>
                        <p>
                            7 причин, почему стоит работать с компанией «ТеплоВит»:
                        </p>
                        <p class="bolid_p">
                            Профессионализм
                        </p>
                        <p>
                            Мы предлагаем исчерпывающие консультации опытных  специалистов, а также грамотные  рекомендации по составлению самого оптимального бюджета Вашего проекта. Компания «ТеплоВит» регулярно отслеживает развитие рынка систем отопления и водоснабжения, чтобы предлагать самое современное и качественное оборудование.
                        </p>
                        <p class="bolid_p">
                            Эффективность
                        </p>
                        <p>
                            Мы ценим  деньги, время и силы своих покупателей, поэтому всегда рекомендуем исключительно  эффективные варианты решения Вашей задачи. Вам не придется тратить свое драгоценное время на анализ множества поставщиков и производителей. Достаточно просто позвонить нашим менеджерам, и Вы получите исчерпывающую информацию по необходимому Вам оборудованию в самые сжатые сроки. Мы всегда подберём наилучший вариант по соотношению цена/качество.
                        </p>
                        <p class="bolid_p">
                            Индивидуальный  подход
                        </p>
                        <p>
                            Мы внимательно  относимся к каждому покупателю, поэтому в компании  «ТеплоВит»  Вы никогда не столкнетесь с поточностью  и шаблонным подходом. Сотрудничество с известными европейскими компаниями позволяет нам индивидуально подобрать каждому клиенту именно тот продукт, который будет максимально соответствовать Вашим требованиям и задачам.
                        </p>
                        <p class="bolid_p">
                            Обязательность
                        </p>
                        <p>
                            Мы четко выполняем взятые на себя обязательства и придерживаемся этических принципов ведения бизнеса. Соблюдаем все условия, сроки и договоренности с нашими клиентами. В любое время Вы можете проверить ход и качество выполняемой нами работы.
                        </p>
                        <p class="bolid_p">
                            Гибкие  условия сотрудничества
                        </p>
                        <p>
                            Наша  работа основывается на лояльном подходе  к пакупателю, оперативности в принятии решений и гибкой ценовой политике. Нами высоко ценится доверие и долгосрочность партнерских отношений, поэтому мы предлагаем обоюдно выгодные условия сотрудничества для постоянных партнеров и посредников.
                        </p>
                        <p class="bolid_p">
                            Гарантии
                        </p>
                        <p>
                            На всю  предлагаемую продукцию, которую поставляет компания «ТеплоВит», производитель предоставляет гарантию качества. Мы всегда поддерживаем своих заказчиков, откликась на различные просьбы. В дальнейшем. со многими из них мы продолжаем сотрудничать уже по другим проектам.
                        </p>
                        <p class="bolid_p">
                            Лучшие  цены
                        </p>
                        <p>
                            Мы заказываем всю продукцию напрямую у мировых и отечественных производителей, а также прямых представителей. Это позволяет нам поставлять своим заказчикам оборудование по лучшим ценам на рынке Беларуссии. Кроме того, постоянные заказчики и партнеры «ТеплоВит» участвуют в гибкой системе скидок и могут смело рассчитывать на еще более выгодные условия сотрудничества.
                        </p>
                        <p class="big_p">Обращайтесь к нам, и мы принесем тепло и уют в Ваши дома!</p>
                    </div>
                </div>
            </div>
        </div>
    </main>
</template>

<script>
export default {
  name: 'About_us_View'
}
</script>