<template>
        <div class="Services_wrapper">
            <div class="Services_info">
                <h1>
                    Услуги
                </h1>
                <p>
                    Компания «ТеплоВит» оказывает следующие услуги: проектирование систем отопления, поставку и монтаж оборудования,  сервис и обслуживание, оформление документации и энергоаудит.
                </p>
            </div>
            <div class="slider_services">
                <div class="dots">
                    <button class="prev_services" @click="changeSlide(-1)">&#10094;</button>
                    <span class="dot" @click="currentSlide(1)"></span>
                    <span class="dot" @click="currentSlide(2)"></span>
                    <span class="dot" @click="currentSlide(3)"></span>
                    <span class="dot" @click="currentSlide(4)"></span>
                    <span class="dot" @click="currentSlide(5)"></span>
                    <span class="dot" @click="currentSlide(6)"></span>
                    <button class="next_services" @click="changeSlide(1)">&#10095;</button>
                </div>
                <div class="slides_services">
                    <div class="slide_services active">
                        <h2> Проектирование</h2>
                        <div class="slide_services_4">
                            <p>
                                <img :src="images.etapy" alt="Этапы проектирования">
                                Грамотно выполненный проект отопления – залог успешной, надежной и безопасной эксплуатации здания. Многолетний опыт работы и высокий уровень квалификации наших проектировщиков закладывает основу для вашего будущего комфорта.
                                На расчетном этапе подбирается оборудование, сравнивается несколько вариантов его установки. Выбор наших специалистов основывается на нормативно-технической литературе и собственном практическом опыте. При расчете учитывается материал несущих стен здания (проектирование и монтаж систем отопления в кирпичном или деревянном доме существенно отличаются друг от друга); вид топлива и теплоносителя, режим эксплуатации отдельных помещений и многие другие факторы.
                                Современный подход к проектированию и монтажу систем отопления предполагает как единое регулирование температуры здания, так и температурное регулирование его отдельных зон. В зависимости от ваших пожеланий мы можем предложить вам централизованное регулирование температуры или схему установки оборудования с локальным регулированием по частотным радиоканалам. Проектирование системы отопления обязательно увязывается с архитектурой дома и стилем его интерьеров, чтобы не нарушать дизайн концепцию.
                            </p>
                            <p>
                                Сегодня большой популярностью пользуется проекты коттеджей, созданные при непосредственном участии заказчиков. С одной стороны – это позволяет учесть все его пожелания, сделать жилье максимально комфортным. С другой стороны -  требует тщательного, точного, профессионального участия опытных специалистов. Малейшая ошибка может привести к серьезным финансовым издержкам. Неквалифицированный подход к созданию документации или недоработанный проект значительно увеличивают стоимость монтажа отопления в частном доме. Кроме того, ошибки в расчетах проекта негативно сказываются на безопасности эксплуатации оборудования, его эффективности, а при устройстве отопления в деревянном доме еще и на безопасность всего строения. Поэтому все этапы предстоящей работы лучше всего согласовывать со специализированными организациями, которые имеют необходимый опыт, квалификацию, лицензии, разрешения.
                            </p>
                            <p>
                                Специалисты нашей компании при проектировании отопленния в помещениях загородного дома, коттеджа или любого другого объекта решают следующие основные задачи:
                            </p>
                            <ul>
                                <li>
                                    Теплотехнический расчет зданий дает четкое представление о том, будет ли у вас образовываться конденсат на стенах и окнах, сколько утеплителя нужно заложить в конструкцию наружной стены и кровли учитывая режим ограждающих конструкций(степень влажности), какой конструкции они должны быть, какие окна и двери можно выбрать, сколько тепла нужно подать в помещение чтобы поддерживать комфортную температуру, сколько тепла нужно для нагрева инфильтрирующегося воздуха. Какая конструкция пола должна быть над неотаплевыемым помещением или проездом.
                                </li>
                                <li>
                                    Гидравлический расчет систем отопления представляет собой отдельный этап. Выполняется после выбора конструкции системы и расчета тепловых нагрузок. Гидравлический расчет определяет выбор насоса и оптимальный диаметр труб для циркуляции теплоносителя. Точный расчет исключает затраты на трубы завышенного диаметра и нагрев лишнего объема воды (экономическая выгода).
                                </li>
                                <li>
                                    Пояснительная записка освещает все принятые решения при проектировании системы отопления и описывает основные принципы управления и регулирования;
                                </li>
                                <li>
                                    Трассировка стояков отопления и трубопроводов позволяет в некоторых случаях избежать установки регулирующей арматуры;
                                </li>
                                
                                <li>
                                    Подбор и расстановка коллекторных узлов позволяет избежать излишней разницы давлений при увязке отопительных приборов;
                                </li>
                                
                                <li>
                                    Схема подключения коллекторного узла изменяется в зависимости от схемы регулирования теплоотдачи отопительных приборов;
                                </li>
                                
                                <li>
                                    Расклад трубопроводов тёплых полов по помещениям позволяет оптимизировать тепловой поток в те места где он необходим и учесть условия комфорта. Также разделить пол на зоны для лучшей гидравлической увязки;
                                </li>
                                
                                <li>
                                    Схема конструкции тёплых полов имеет значение при расчете диаметра и шага укладки труб теплого пола;
                                </li>
                                
                                <li>
                                    Расстановка датчиков температуры (по отдельному заданию) имеет большое значение при установке приборов в нишах либо аналогичных местах, где датчики не будут работать правильно;
                                </li>
                                
                                <li>
                                    Спецификация оборудования и материалов сделанная в специализированной программе включает все элементы системы отопления;
                                </li> 
                                
                                <li>
                                    Соблюдение необходимых температур внутреннего воздуха в помещениях в зависимости от назначения помещения и процессов происходящих в нем;
                                </li>
                                
                                <li>
                                    Разработка единой системы управления позволит сократить затраты на тепловую энергию и подключить систему отопления к системе "Умный дом";
                                </li>
                                
                                <li>
                                    Снижение затрат на эксплуатацию и ремонт возможно достигнуть,  если не зажимать систему (позволяет выбрать насос дешевле), устраивать выпуск воздухав верхних точках системы, устраивать слив веток и стояков в нижних точках системы, устанавливать арматуру в легкодоступные места, поддерживать только ту температуру в помещениях которая необходима для нормальных условий эксплуатации здания;
                                </li>
                                
                                <li>
                                    Использование оборудования от единого поставщика позволяет упростить поиски поставщика, упростить ремонт, получить всю информацию в одном месте;
                                </li>
                            
                                <li>
                                    Снижение затрат на модернизацию или наращивание мощностей возможно, если это предусмотреть на стадии проектирования;
                                </li>
                                
                                <li>
                                    Технико-экономическое сравнение вариантов системы отопления позволяет выбрать оптимальный вариант цена-качество;
                                </li>
                                <li>
                                    Разработка вопросов безопасности, связанных с системами отопления позволяет избежать ожогов и ухудшения теплоотдачи приборов.
                                </li>
                            </ul>
                        </div>
                    </div>
                    <div class="slide_services">
                        <h2>Поставка оборудования</h2>
                        <p>
                            Компания «ТеплоВит» обеспечивает  комплексные поставки отопительного оборудования, способного обеспечить теплом квартиру, индивидуальный коттедж, многоквартирный дом, большое предприятие и целый городской район!
                            Отопительная система – это не просто источник тепла. Необходимо управлять количеством выработанного тепла, и, кроме того, его нужно распределить и передать. Во многих случаях следует также учесть необходимость приготовления горячей воды, требования защиты окружающей среды, эффективность конструкции, простоту в эксплуатации и удобство пользователя. Специалистам, желающим получить максимальную выгоду, необходимо смотреть на систему как на единое целое, состоящее из различных дополняющих друг друга компонентов. Именно в этом и заключается наша сильная сторона. Используя отопительное оборудование «ТеплоВит», вы можете быть уверены в согласованности всех компонентов, независимо от вида топлива, технологии отопления или элемента в цепочке процесса производства тепла. Компания «ТеплоВит» всегда гарантирует идеальную совместимость всех компонентов.
                            Компания «ТеплоВит» предлагает высококачественные системы отопления домов любого вида для любых заказчиков. У нас вы можете приобрести котельное оборудование, работающее на любом источнике энергии: газе, электроэнергии, твердом или жидком топливе, системы автоматического управления для любого типа систем отопления, водонагреватели и насосы, радиаторы и трубы, тепловые насосы, системы отвода продуктов сгорания, водоподготовительное оборудование и многое другое.
                            Мы всегда гарантируем отличное качество и хорошую цену на поставляемое  оборудование.
                        </p>
                    </div>
                    <div class="slide_services">
                        <h2>Монтаж</h2>
                        <div class="slide_services_4">
                            <p>
                                <img :src="images.montazh" alt="Монтаж газового котла">
                                Для обеспечения максимальной эффективности и экономичности работы, а также исключения вероятности появления сбоев или неисправностей, важно, чтобы услуги по монтажу системы отопления оказывались только профессионалами.
                                Монтаж системы автономного отопления выполняется с учетом особенностей подключения других инженерных коммуникаций так, чтобы обеспечить их качественное, бесперебойное и безопасное для человека взаимодействие. Важно отметить, что ключевым моментом в оказании услуги по монтажу отопления является выбор типа системы — от этого будет зависеть и стоимость, и эффективность ее эксплуатации.
                                В любом случае важно, чтобы монтаж отопления под ключ выполнялся сертифицированными работниками со строгим соблюдением всех требований проектной документации. Только в этом случае можно гарантировать качество результата.
                            </p>
                            <p>
                                Компания «ТеплоВит» — квалифицированный монтаж системы отопления
                            </p>
                            <p>
                                Наши специалисты обладают высокой квалификацией, всеми навыками и знаниями, необходимыми для качественного проведения работ. Монтаж систем отопления от организации «ТеплоВит» — это всегда комплексное обслуживание, нацеленное на то, чтобы создать не просто работоспособные, а эффективные, надежные и безопасные отопительные коммуникации.
                            </p>
                            <p>
                                Компания «ТеплоВит» — это монтаж систем отопления, который выполняется в несколько этапов:
                            </p>
                            <ul>
                                <li>
                                    Предварительная оценка объекта;
                                </li>
                                <li>
                                    Подготовка проекта;
                                </li>
                                <li>
                                    Подбор оборудования;
                                </li>
                                <li>
                                    Установка, тестирование и ввод в эксплуатацию.
                                </li>
                            </ul>
                            <p>
                                Услуги по монтажу отопления включают в себя бесплатный выезд специалистов для оценки «фронта работ». На данном этапе выполняется обмер помещений, первичный осмотр, общая оценка предполагаемого проекта, консультирование заказчика по возникающим вопросам.
                                Далее услуги по монтажу системы отопления предполагают проектирование будущих коммуникаций. Оно включает в себя полный расчет характеристик оборудования и нагрузки на него, определение предполагаемой комплектации (элементов будущей отопительной системы), а также их расположения. По результатам заказчик получает полностью готовый проект, включающий в себя детальную информацию о том, как должен выполняться монтаж систем отопления в организации или жилом помещении, а также всю необходимую строительную документацию.
                                Финальный этап в исполнении сотрудников «ТеплоВит» — это монтаж систем отопления, который предполагает приобретение необходимого оборудования, сборку отдельных элементов, прокладку труб, установку котлов, батарей и т.п. Работы считаются завершенными только после тестирования и полного ввода в эксплуатацию отопительных коммуникаций.
                                Квалифицированные сотрудники нашей компании могут обеспечить выполнение проекта любой сложности. Предлагая,  в комплексе, лучшие цены  в Белоруссии на поставку  и монтаж систем отопления,  мы гарантируем качество и надежность системы,  а так же снижение затрат  и существенную экономию Вашего бюджета на строительство.
                            </p>
                        </div>
                    </div>
                    <div class="slide_services">
                        <h2>Сервис и обслуживание</h2>
                        <div class="slide_services_4">
                            <p>
                                <img :src="images.servises" alt="">    
                                Компания «ТеплоВит» поставляет только то оборудование, в котором мы уверены. Сервисный центр при компании «ТеплоВит» осуществляет гарантийное и послегарантийное обслуживание отопительной техники тех марок, которые у нас представлены.
                                Для продолжительной эксплуатации, любая техника нуждается в периодическом сервисном обслуживании, которое продлевает его ресурс и снижает эксплуатационные затраты.
                            </p>
                            <p>
                                Мы знаем наше оборудование изнутри.
                                Сервисный центр – это специально обученные сервисные инженеры, наличие необходимых запчастей и инструментов, оперативное реагирование на вызов. Сервисный договор – это соглашение между Владельцем отопительного оборудования и сервисным центром компании «ТеплоВит». Договор гарантирует техническую поддержку Вашего оборудования в течение всего срока службы.
                            </p>
                        </div>
                    </div>
                    <div class="slide_services">
                        <h2>Оформление документации</h2>
                        <p> 
                            Невозможно представить современный дом без спецоборудования и инженерных коммуникаций (водоснабжение, канализация, отопление, газоснабжение, электроснабжение) . У каждого дома, коттеджа, так же как и в городской застройк, должна быть схема подведения и подключения всех коммуникаций. Для приобретения и размещения всего необходимого оборудования должны быть произведены расчёты с учётом нагрузки (выделенная и потребляемая мощность в системе энергоснабжения и газификации), объема, площади, функциональности помещений и др. особенностей. Компания «ТеплоВит» оказывает полный комплекс услуг по оформлению документации инженерных коммуникаций.
                            В процессе оформления и подведения коммуникаций к Вашему дому Вы сталкиваетесь с многочисленным хождением по различным инстанциям и волокитой. Вопрос с прокладкой инженерных коммуникаций к дому необходимо продумывать и согласовывать заблаговременно, перед началом строительства. Любое проектирование по подведению инженерных коммуникаций начинается с получения технических условий на подключение. Наши специалисты в максимально короткие сроки, подготовят и оформят всю необходимую документацию для получения технических условий на подключение. Это обеспечивает гарантированное исполнение обязательств по получению технических условий на подключение инженерных коммуникаций. При одновременном заключении с нами договора на оказание услуг по получению технических условий, договора на прокладку инженерных коммуникаций и полному обеспечению объекта инфраструктурой, Вы значительно снизите свои затраты, не только на стоимость за получение разрешительных документов и прокладку коммуникаций, но и многократно ускорите по времени весь процесс. При строительстве коттеджа или дачного дома, для того чтобы он был не менее комфортным, чем городская квартира, необходимо обеспечить его: электричеством, газом, водопроводом и канализацией. Принцип согласования подвода всех этих видов коммуникаций одинаков.
                            Отдельной строкой можно выделить газификацию Вашего дома. При проектировании вашего дома необходимо учесть все технические моменты, которые будут связаны с вводом газовой трубы в дом, расположение котельной (бойлерной) в доме, газового и котельного оборудования в ней, а также системы вентиляции дома и дымохода для газового котла. Мы предлагаем Вам помощь в оформлении необходимых технических документов которые требуются, для получения технических условий и проектирования при газификации. Наша компания во взаимодействии с нашими партнерами, имеющими многолетний опыт работы в сфере газификации объектов жилого строительства, проконсультирует Вас в самом начале строительства, поможем грамотно расположить газовое и тепловое оборудование, вентиляционные каналы, дымоходы, мы подготовим  весь необходимый пакет документов для газификации строения. Мы берем на себя всю работу по взаимодействию со всеми службами и организациями, которые так, или иначе будут задействованы в процессе газификации объекта. Мы обеспечим проведение работ по топографической съемке земельного участка, получим технический и кадастровый паспорт БТИ на строение, акты на устанавливаемое оборудование, всевозможные справки и заключения, заключим договора с газовой службой, и получим необходимые документы для оплаты предоставленной услуги по поставке природного газа.
                            Если вы дорожите своим временем, отдаете должное качественной работе, экономите свои деньги и нервы то, наша компания готова к сотрудничеству с Вами. Существует множество разнообразных определений понятию «услуга», и практически все они сходятся в одном – услуга это действие в интересах потребителя. В строительном бизнесе, как и в любом другом бизнесе последовательность, чёткость и обоснованность действий является показателем профессионализма.
                            В наши услугипо газификации входит:
                            <ul>
                                <li>
                                    Получение технических условий на газификацию
                                </li>
                                <li>
                                    Проектная документация на газоснабжение и ее согласование
                                </li>
                                <li>
                                    Подведение газа непосредственно к объекту
                                </li>
                                <li>
                                    Расчет мощности котельного оборудования, проектирование и его установка
                                </li>
                                <li>
                                    Расчет мощности котельного оборудования, проектирование и его установка
                                </li>
                                <li>
                                    Гарантийной обслуживание котельного оборудования
                                </li>
                                <li>
                                    Установка всех типов дымоходов и вент каналов профессионально и качественно.
                                </li>
                                <li>
                                    Оформление документации инженерных коммуникаций 
                                </li>
                            </ul>
                            
                        </p>
                    </div>
                    <div class="slide_services">
                        <h2>Энергоаудит</h2>
                        <p>
                            Компания «ТеплоВит» проводит энергетические обследования (энергоаудит) тепловых хозяйств различных видов (первичное, периодическое, внеочередное, локальное, экспресс-обследование) в соответствии с поставленными задачами объектов энергетики, промышленности, жилищно-коммунального хозяйства с расчетом технологических нормативов, экономически выгодных режимов на производство и передачу энергетических ресурсов, с выдачей энергетических паспортов и разработкой программ в области энергосбережения и повышения энергоэффективности. Она занимается оснащением и комплектацией предприятий современным энергосберегающим оборудованием с последующим эксплуатационным сопровождением.
                            Проведение различных энергетических обследований источников теплоснабжения любой установленной мощности и тепловых сетей объектов жилищно-коммунального хозяйства (ЖКХ), в том числе предприятий коммунальной энергетики. На базе выполненных энергетических обследований определяется состояние основного и вспомогательного оборудования теплоисточника, состояние строительных конструкций зданий и сооружений, состояние тепловых сетей. По результатам обследования разрабатываются рекомендации по повышению надёжности и эффективности работы теплоисточника и тепловых сетей.
                            Проведение локальных целевых обследований оборудования энергохозяйств и отдельных цехов предприятий (системы паро-, тепло-, водо-, воздухоснабжения предприятий, источники теплоснабжения) с использованием портативных приборов импортного производства. На основании инструментального обследования с использованием современной диагностической аппаратуры определяется фактическое потребление энергоресурсов. Сравнение фактических данных с нормативными (расчётными) значениями позволяет судить об эффективности энергоиспользования на предприятиях и разрабатывать рекомендации по их повышению.
                            Проведение комплексных энергетических обследований с выполнением технологического и финансового аудита Выполнение работ по сбору исходной информации, расчету и уточнению присоединенных нагрузок потребителей к источникам теплоснабжения. Спад производства и внедрение энергосберегающих мероприятий на многих предприятиях в значительной степени повлияли на уровень присоединённой к теплоисточникам нагрузки. Установленное оборудование, рассчитанное на покрытие тепловых нагрузок по ранее утверждённым проектам, в настоящее время не загружено и работает не в номинальном режиме с низким коэффициентом полезного действия. Целесообразность его сохранения, демонтажа или модернизации может быть решена только при наличии информации по его перспективной загрузке, определяемой в процессе выполнения данной работы.
                            Составление баланса потребления предприятием топливно-энергетических ресурсов (ТЭР), выявление нерациональных потерь ТЭР. Разработка энергетических паспортов осуществляется в соответствии с нормативными требованиями. Программы энергосбережения и повышения энергоэффективности предприятий составляются с оценкой затрат на реализацию предлагаемых мероприятий, расчётом экономического эффекта и сроков окупаемости.
                            Разработка предложений и мероприятий, направленных на повышение технико-экономических и эксплуатационных характеристик, показателей надежности энергетического оборудования, по оптимизации процессов производства и загрузки оборудования. Разработка предложений и мероприятий базируется на результатах испытаний оборудования и построенных на их основе энергетических характеристиках, позволяющих оптимизировать процесс производства и загрузки оборудования.
                        </p>
                    </div>
                </div>
            
                <!-- <button class="prev_services" onclick="changeSlide(-1)">&#10094;</button>
                <button class="next_services" onclick="changeSlide(1)">&#10095;</button> -->
            
                
            </div>
        </div>
</template>
<script>
import etapyImage from '@/assets/images/etapy-proektirovaniya-kotelnoj.jpg'
import montazhImage from '@/assets/images/642-montazh-ustanovka-gazovogo-kotla.jpg'
import servisesImage from '@/assets/images/servises.png'

export default {
    name: 'ServicesView',
    data() {
    return {
      slideIndex: 1,
      images: 
            {
                etapy: etapyImage,
                montazh: montazhImage,
                servises: servisesImage
            }
        }
    },
    mounted() {
        this.showSlides(this.slideIndex);
    },
    methods: {
        showSlides(n) {
        const slides = document.querySelectorAll('.slide_services');
        const dots = document.querySelectorAll('.dot');

        if (n > slides.length) { this.slideIndex = 1; }
        if (n < 1) { this.slideIndex = slides.length; }

        slides.forEach((slide, index) => {
            slide.style.display = (index + 1 === this.slideIndex) ? 'block' : 'none';
            dots[index].className = dots[index].className.replace(' active', '');
        });

        dots[this.slideIndex - 1].className += ' active';
        },
        changeSlide(n) {
        this.showSlides(this.slideIndex += n);
        },
        currentSlide(n) {
        this.showSlides(this.slideIndex = n);
        }
    }
}
</script>